Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortStateManager
The Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortStateManager class provides an extension method for indicating short lived states on a System.Windows.Controls.Control instance.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortStateManager.ActiveStates
The collection of active states.
Items are added by Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortStateManager.ActivateState(System.Windows.Controls.Control,Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState) and removed by Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortStateManager.OnStateEnded(Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState).

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortStateManager.#cctor
Initializes static members of the Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortStateManager class.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortStateManager.ActivateState(System.Windows.Controls.Control,Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState)
Activates the given Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState on item.
If a state is already active for item, the existing state is either renewed or stopped and replaced.
item: The item to activate shortState on.
shortState: The Tekla.BIM.DirectManipulation.Services.Controls.ControlShortState to activate on item.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortStateManager.OnStateEnded(Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState)
Handles the Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortState.Ended event by unregistering the event handler
and removing state from the Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlShortStateManager.ActiveStates collection.
state: The ended state.